{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 64, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 64, 1], "name": "input_2", "sparse": false}, "name": "input_2"}, {"class_name": "Conv3D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_1"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "config": {"name": "p_re_lu_1", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_1"}], "input_layers": [["input_2", 0, 0]], "name": "model_1", "output_layers": [["batch_normalization_1", 0, 0]]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "model_1"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 64, 16], "name": "input_3", "sparse": false}, "name": "input_3"}, {"class_name": "Conv3D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2, 2]}, "name": "conv3d_2"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "config": {"name": "p_re_lu_2", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_2"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Conv3D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_3"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_3", 0, 0, {}]]], "config": {"name": "p_re_lu_3", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_3"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_4"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_4", 0, 0, {}]]], "config": {"name": "p_re_lu_4", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_4"}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}, "name": "add_1"}], "input_layers": [["input_3", 0, 0]], "name": "model_2", "output_layers": [["add_1", 0, 0]]}, "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "model_2"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 32, 32], "name": "input_4", "sparse": false}, "name": "input_4"}, {"class_name": "Conv3D", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2, 2]}, "name": "conv3d_5"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_5", 0, 0, {}]]], "config": {"name": "p_re_lu_5", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_5"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Conv3D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_6"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_6", 0, 0, {}]]], "config": {"name": "p_re_lu_6", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_6"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_7"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_7", 0, 0, {}]]], "config": {"name": "p_re_lu_7", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_7"}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2"}, "name": "add_2"}], "input_layers": [["input_4", 0, 0]], "name": "model_3", "output_layers": [["add_2", 0, 0]]}, "inbound_nodes": [[["model_2", 1, 0, {}]]], "name": "model_3"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 16, 64], "name": "input_5", "sparse": false}, "name": "input_5"}, {"class_name": "Conv3D", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2, 2]}, "name": "conv3d_8"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_8", 0, 0, {}]]], "config": {"name": "p_re_lu_8", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_8"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "Conv3D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_9"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_9", 0, 0, {}]]], "config": {"name": "p_re_lu_9", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_9", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_9"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_10"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_10", 0, 0, {}]]], "config": {"name": "p_re_lu_10", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_10", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_10"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_11"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_11", 0, 0, {}]]], "config": {"name": "p_re_lu_11", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_11", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_11"}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}], ["dropout_3", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3"}, "name": "add_3"}], "input_layers": [["input_5", 0, 0]], "name": "model_4", "output_layers": [["add_3", 0, 0]]}, "inbound_nodes": [[["model_3", 1, 0, {}]]], "name": "model_4"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 16, 16, 8, 128], "name": "input_6", "sparse": false}, "name": "input_6"}, {"class_name": "Conv3D", "inbound_nodes": [[["input_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_12", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2, 2]}, "name": "conv3d_12"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_12", 0, 0, {}]]], "config": {"name": "p_re_lu_12", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_12", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_12"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "name": "dropout_4"}, "name": "dropout_4"}, {"class_name": "Conv3D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_13"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_13", 0, 0, {}]]], "config": {"name": "p_re_lu_13", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_13"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_13", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_13"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_14", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_14"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_14", 0, 0, {}]]], "config": {"name": "p_re_lu_14", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_14"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_14", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_14"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_15"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_15", 0, 0, {}]]], "config": {"name": "p_re_lu_15", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_15"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_15", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_15"}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}], ["dropout_4", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4"}, "name": "add_4"}], "input_layers": [["input_6", 0, 0]], "name": "model_5", "output_layers": [["add_4", 0, 0]]}, "inbound_nodes": [[["model_4", 1, 0, {}]]], "name": "model_5"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 8, 8, 4, 256], "name": "input_7", "sparse": false}, "name": "input_7"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["input_7", 0, 0, {}]]], "config": {"size": [2, 2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling3d_1"}, "name": "up_sampling3d_1"}, {"class_name": "Conv3D", "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_16", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2, 2]}, "name": "conv3d_16"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_16", 0, 0, {}]]], "config": {"name": "p_re_lu_16", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_16"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_16", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_16"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "name": "dropout_5"}, "name": "dropout_5"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 16, 16, 8, 128], "name": "input_8", "sparse": false}, "name": "input_8"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_5", 0, 0, {}], ["input_8", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1"}, {"class_name": "Conv3D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_17", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_17"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_17", 0, 0, {}]]], "config": {"name": "p_re_lu_17", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_17"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_17", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_17"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_18", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_18"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_18", 0, 0, {}]]], "config": {"name": "p_re_lu_18", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_18"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_18", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_18"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_19"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_19", 0, 0, {}]]], "config": {"name": "p_re_lu_19", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_19"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_19", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_19"}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["concatenate_1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_5"}, "name": "add_5"}], "input_layers": [["input_7", 0, 0], ["input_8", 0, 0]], "name": "model_6", "output_layers": [["add_5", 0, 0]]}, "inbound_nodes": [[["model_5", 1, 0, {}], ["model_4", 1, 0, {}]]], "name": "model_6"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 16, 16, 8, 256], "name": "input_9", "sparse": false}, "name": "input_9"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["input_9", 0, 0, {}]]], "config": {"size": [2, 2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling3d_2"}, "name": "up_sampling3d_2"}, {"class_name": "Conv3D", "inbound_nodes": [[["up_sampling3d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2, 2]}, "name": "conv3d_20"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_20", 0, 0, {}]]], "config": {"name": "p_re_lu_20", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_20"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_20", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_20"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "name": "dropout_6"}, "name": "dropout_6"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 16, 64], "name": "input_10", "sparse": false}, "name": "input_10"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_6", 0, 0, {}], ["input_10", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "name": "concatenate_2"}, {"class_name": "Conv3D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_21"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_21", 0, 0, {}]]], "config": {"name": "p_re_lu_21", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_21"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_21", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_21"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_22", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_22"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_22", 0, 0, {}]]], "config": {"name": "p_re_lu_22", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_22"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_22", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_22"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_23", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_23"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_23", 0, 0, {}]]], "config": {"name": "p_re_lu_23", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_23"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_23", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_23", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_23"}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}], ["concatenate_2", 0, 0, {}]]], "config": {"trainable": true, "name": "add_6"}, "name": "add_6"}], "input_layers": [["input_9", 0, 0], ["input_10", 0, 0]], "name": "model_7", "output_layers": [["add_6", 0, 0]]}, "inbound_nodes": [[["model_6", 1, 0, {}], ["model_3", 1, 0, {}]]], "name": "model_7"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 16, 128], "name": "input_11", "sparse": false}, "name": "input_11"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["input_11", 0, 0, {}]]], "config": {"size": [2, 2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling3d_3"}, "name": "up_sampling3d_3"}, {"class_name": "Conv3D", "inbound_nodes": [[["up_sampling3d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_24", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2, 2]}, "name": "conv3d_24"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_24", 0, 0, {}]]], "config": {"name": "p_re_lu_24", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_24"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_24", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_24", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_24"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "name": "dropout_7"}, "name": "dropout_7"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 32, 32], "name": "input_12", "sparse": false}, "name": "input_12"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_7", 0, 0, {}], ["input_12", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_3", "axis": -1}, "name": "concatenate_3"}, {"class_name": "Conv3D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_25", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_25"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_25", 0, 0, {}]]], "config": {"name": "p_re_lu_25", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_25"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_25", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_25"}, {"class_name": "Conv3D", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_26", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_26"}, {"class_name": "PReLU", "inbound_nodes": [[["conv3d_26", 0, 0, {}]]], "config": {"name": "p_re_lu_26", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": [1, 2, 3]}, "name": "p_re_lu_26"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["p_re_lu_26", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_26", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_26"}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}], ["concatenate_3", 0, 0, {}]]], "config": {"trainable": true, "name": "add_7"}, "name": "add_7"}], "input_layers": [["input_11", 0, 0], ["input_12", 0, 0]], "name": "model_8", "output_layers": [["add_7", 0, 0]]}, "inbound_nodes": [[["model_7", 1, 0, {}], ["model_2", 1, 0, {}]]], "name": "model_8"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_6", "size": [2, 2, 2]}, "inbound_nodes": [[["model_7", 1, 0, {}]]], "name": "up_sampling3d_6"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 32, 64], "name": "input_13", "sparse": false}, "name": "input_13"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["input_13", 0, 0, {}]]], "config": {"size": [2, 2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling3d_4"}, "name": "up_sampling3d_4"}, {"class_name": "Conv3D", "inbound_nodes": [[["up_sampling3d_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_27", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [2, 2, 2]}, "name": "conv3d_27"}, 